InformationRegisters/НаградыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НаградыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Награда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Награды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Награждение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Награды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Награды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодОКИН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлассификатора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияНаграды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииНаград</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНаграды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьВТ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторноеНаграждениеНеПредусмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсутствиеДисциплинарныхВзысканий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйВозраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйВозраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоблюдатьПоследовательностьНаграждения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МинимальныеСтажиРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияСтажа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КатегорииСтажа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЛет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОграничениеДолжностей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОграничениеДолжности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнтервалыНаграждения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНаграды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Награды</v8:Type>
								<v8:Type>cfg:CatalogRef.КатегорииНаград</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Интервал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаличиеНаград</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Награда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Награды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НаградыФизическихЛиц/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Награды физических лиц.
// 
// Параметры:
//  ФизическиеЛица	- Массив - список физических лиц.
//  НаДату 			- Дата	 - срез на дату (проверка по дате приказа).
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Награды физических лиц
Функция НаградыФизическихЛиц(ФизическиеЛица, НаДату = Неопределено) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	Запрос.УстановитьПараметр("ДатаПриказа", НаДату);
	Запрос.УстановитьПараметр("ОтборПоДате", ТипЗнч(НаДату) = Тип("Дата"));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НаградыФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НаградыФизическихЛиц.Награда КАК Награда,
		|	ЕСТЬNULL(КатегорииНаград.Ссылка, ЗНАЧЕНИЕ(Справочник.КатегорииНаград.ПустаяСсылка)) КАК КатегорияНаграды,
		|	НаградыФизическихЛиц.НомерПриказа КАК НомерПриказа,
		|	НаградыФизическихЛиц.ДатаПриказа КАК ДатаПриказа,
		|	ПРЕДСТАВЛЕНИЕ(НаградыФизическихЛиц.Награда) КАК ПредставлениеНаграды
		|ИЗ
		|	РегистрСведений.НаградыФизическихЛиц КАК НаградыФизическихЛиц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Награды КАК Награды
		|		ПО НаградыФизическихЛиц.Награда = Награды.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииНаград КАК КатегорииНаград
		|		ПО (Награды.КатегорияНаграды = КатегорииНаград.Ссылка)
		|ГДЕ
		|	НаградыФизическихЛиц.ФизическоеЛицо В(&ФизическиеЛица)
		|	И (НаградыФизическихЛиц.ДатаПриказа <= &ДатаПриказа
		|			ИЛИ НЕ &ОтборПоДате)";
	
	НаградыФизическихЛиц = Запрос.Выполнить().Выгрузить();
	
	Возврат НаградыФизическихЛиц;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ФизическоеЛицо",
		"РегламентированныеДанные");
КонецПроцедуры

#КонецОбласти

// Создает новую структуру для сведений об награде.
// 
// Возвращаемое значение:
//  Структура:
//   * ФизическоеЛицо	- СправочникСсылка.ФизическиеЛица -
//   * НомерПоПорядку	- Число -
//   * Награда			- СправочникСсылка.Награды -
//   * НаименованиеНаграды	- Строка -
//   * НаименованиеКатегорииНаграды	- Строка -
//   * НомерПриказа		- Строка -
//   * ДатаПриказа 		- Дата -
//   * НаименованиеПриказа 		- Строка -
//   * ДокументРегистратор 		- ДокументСсылка.Награждение -
Функция НоваяНаградаФизическогоЛица() Экспорт
	
	СтруктураЗаписи = ОбщегоНазначенияБЗК.СтруктураПоИмениРегистраСведений("НаградыФизическихЛиц");
	
	СтруктураЗаписи.Вставить("НаименованиеНаграды");
	СтруктураЗаписи.Вставить("НаименованиеКатегорииНаграды");
	
	Возврат СтруктураЗаписи;
	
КонецФункции

// Заполняет награды физического лица.
// 
// Параметры:
//  КоллекцияЗаписей - Массив из Структура - см. НоваяНаградаФизическогоЛица
//  НеПроверятьЗаписиДанныхФизическихЛиц - Булево - 
Процедура ЗарегистрироватьНаградыФизическихЛиц(КоллекцияЗаписей, НеПроверятьЗаписиДанныхФизическихЛиц = Ложь) Экспорт
	
	Если КоллекцияЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НаградыФизическихЛиц.СоздатьНаборЗаписей();
	
	Для Каждого ТекущаяСтрока Из КоллекцияЗаписей Цикл
		
		Награда = ТекущаяСтрока.Награда;
		Если Не ЗначениеЗаполнено(Награда) Тогда
			КатегорияНаграды = Справочники.КатегорииНаград.НоваяКатегорияНаграды(ТекущаяСтрока.НаименованиеКатегорииНаграды);
			Награда = Справочники.Награды.НоваяНаграда(ТекущаяСтрока.НаименованиеНаграды,, КатегорияНаграды);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Награда) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекущаяСтрока,, "Награда");
		НоваяЗапись.Награда = Награда;
		
	КонецЦикла;
	
	Если НеПроверятьЗаписиДанныхФизическихЛиц Тогда
		НаборЗаписей.ДополнительныеСвойства.Вставить("НеПроверятьЗаписиДанныхФизическихЛиц", НеПроверятьЗаписиДанныхФизическихЛиц);
	КонецЕсли;

	НаборЗаписей.Записать(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОчиститьНаградыФизическихЛиц(ДокументРегистратор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаградыФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НаградыФизическихЛиц.НомерПоПорядку КАК НомерПоПорядку
	|ИЗ
	|	РегистрСведений.НаградыФизическихЛиц КАК НаградыФизическихЛиц
	|ГДЕ
	|	НаградыФизическихЛиц.ДокументРегистратор = &ДокументРегистратор";
	Запрос.УстановитьПараметр("ДокументРегистратор", ДокументРегистратор);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);
			НаборЗаписей.Отбор.НомерПоПорядку.Установить(Выборка.НомерПоПорядку);
			НаборЗаписей.Записать();
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
